In [381]:
import numpy as np
import pandas as pd

In [11]:
benimSozlugum = {"melisa" : 25, "sinan" : 22, "nazlı" : 20}

In [13]:
pd.Series(benimSozlugum)

melisa    25
sinan     22
nazlı     20
dtype: int64

In [14]:
benimYaslarim = [25,22,20]
benimİsimlerim = ["melisa", "sinan", "nazlı"]

In [17]:
pd.Series(benimYaslarim)

0    25
1    22
2    20
dtype: int64

In [19]:
pd.Series(benimYaslarim, benimİsimlerim)

melisa    25
sinan     22
nazlı     20
dtype: int64

In [21]:
pd.Series(data = benimYaslarim, index = benimİsimlerim)

melisa    25
sinan     22
nazlı     20
dtype: int64

In [23]:
numpyDizisi = np.array([25,22,20])

In [25]:
numpyDizisi

array([25, 22, 20])

In [26]:
pd.Series(numpyDizisi)

0    25
1    22
2    20
dtype: int64

In [29]:
pd.Series(numpyDizisi, benimİsimlerim)

melisa    25
sinan     22
nazlı     20
dtype: int64

In [31]:
pd.Series(["hüseyin", "çiğdem", "cemre"])

0    hüseyin
1     çiğdem
2      cemre
dtype: object

In [32]:
pd.Series(["hüseyin", "çiğdem", "cemre"],[1,2,3])

1    hüseyin
2     çiğdem
3      cemre
dtype: object

In [33]:
yarismaSonucu1 = pd.Series([10,5,1],["hüseyin","çiğdem","cemre"])

In [37]:
yarismaSonucu1

hüseyin    10
çiğdem      5
cemre       1
dtype: int64

In [38]:
yarismaSonucu2 = pd.Series([20,10,8],["hüseyin","çiğdem","cemre"])

In [41]:
yarismaSonucu2

hüseyin    20
çiğdem     10
cemre       8
dtype: int64

In [42]:
yarismaSonucu2["çiğdem"]

10

In [45]:
sonSonuc= yarismaSonucu1 + yarismaSonucu2

In [46]:
sonSonuc

hüseyin    30
çiğdem     15
cemre       9
dtype: int64

In [49]:
farkliSeries = pd.Series([20,30,40,50], ["a","b","c","d"])

In [50]:
farkliSeries2 = pd.Series([10,5,3,1],["a","c","f","g"])

In [53]:
farkliToplam = farkliSeries + farkliSeries2

In [54]:
farkliToplam

a    30.0
b     NaN
c    45.0
d     NaN
f     NaN
g     NaN
dtype: float64

In [55]:
data = np.random.randn(4,3)

In [57]:
data

array([[ 0.44004909, -1.45434401, -2.07448502],
       [ 0.86705737,  1.89529348,  1.22860506],
       [-1.57357901, -0.90411959,  0.19120137],
       [ 1.04674729,  1.03540975, -0.93041943]])

In [59]:
dataFrame = pd.DataFrame(data)

In [61]:
dataFrame

          0         1         2
0  0.440049 -1.454344 -2.074485
1  0.867057  1.895293  1.228605
2 -1.573579 -0.904120  0.191201
3  1.046747  1.035410 -0.930419

In [62]:
dataFrame[0]

0    0.440049
1    0.867057
2   -1.573579
3    1.046747
Name: 0, dtype: float64

In [63]:
type(dataFrame[0])

pandas.core.series.Series

In [66]:
yeniFrame = pd.DataFrame(data,index = ["melisa","hüseyin","çiğdem","cemre"],columns=["maaş","yaş","çalışma saati"])

In [67]:
yeniFrame

             maaş       yaş  çalışma saati
melisa   0.440049 -1.454344      -2.074485
hüseyin  0.867057  1.895293       1.228605
çiğdem  -1.573579 -0.904120       0.191201
cemre    1.046747  1.035410      -0.930419

In [71]:
yeniFrame["yaş"]

melisa    -1.454344
hüseyin    1.895293
çiğdem    -0.904120
cemre      1.035410
Name: yaş, dtype: float64

In [72]:
yeniFrame["çalışma saati"]

melisa    -2.074485
hüseyin    1.228605
çiğdem     0.191201
cemre     -0.930419
Name: çalışma saati, dtype: float64

In [74]:
yeniFrame[["maaş", "yaş"]]

             maaş       yaş
melisa   0.440049 -1.454344
hüseyin  0.867057  1.895293
çiğdem  -1.573579 -0.904120
cemre    1.046747  1.035410

In [76]:
yeniFrame.loc["melisa"]

maaş             0.440049
yaş             -1.454344
çalışma saati   -2.074485
Name: melisa, dtype: float64

In [77]:
yeniFrame.iloc[1]

maaş             0.867057
yaş              1.895293
çalışma saati    1.228605
Name: hüseyin, dtype: float64

In [78]:
yeniFrame

             maaş       yaş  çalışma saati
melisa   0.440049 -1.454344      -2.074485
hüseyin  0.867057  1.895293       1.228605
çiğdem  -1.573579 -0.904120       0.191201
cemre    1.046747  1.035410      -0.930419

In [79]:
yeniFrame["emeklilik yaşı"] = yeniFrame["yaş"] + yeniFrame["yaş"]

In [82]:
yeniFrame

             maaş       yaş  çalışma saati  emeklilik yaşı
melisa   0.440049 -1.454344      -2.074485       -2.908688
hüseyin  0.867057  1.895293       1.228605        3.790587
çiğdem  -1.573579 -0.904120       0.191201       -1.808239
cemre    1.046747  1.035410      -0.930419        2.070820

In [83]:
yeniFrame.drop("emeklilik yaşı", axis = 1) #axis 1 -> sütün

             maaş       yaş  çalışma saati
melisa   0.440049 -1.454344      -2.074485
hüseyin  0.867057  1.895293       1.228605
çiğdem  -1.573579 -0.904120       0.191201
cemre    1.046747  1.035410      -0.930419

In [84]:
yeniFrame.drop("melisa", axis = 0) #axis 0 -> satır

             maaş       yaş  çalışma saati  emeklilik yaşı
hüseyin  0.867057  1.895293       1.228605        3.790587
çiğdem  -1.573579 -0.904120       0.191201       -1.808239
cemre    1.046747  1.035410      -0.930419        2.070820

In [86]:
yeniFrame

             maaş       yaş  çalışma saati  emeklilik yaşı
melisa   0.440049 -1.454344      -2.074485       -2.908688
hüseyin  0.867057  1.895293       1.228605        3.790587
çiğdem  -1.573579 -0.904120       0.191201       -1.808239
cemre    1.046747  1.035410      -0.930419        2.070820

In [90]:
yeniFrame.drop("emeklilik yaşı", axis = 1, inplace = True) #inplace true dediğimizde kendisinde değişiklik yapar

In [92]:
yeniFrame

             maaş       yaş  çalışma saati
melisa   0.440049 -1.454344      -2.074485
hüseyin  0.867057  1.895293       1.228605
çiğdem  -1.573579 -0.904120       0.191201
cemre    1.046747  1.035410      -0.930419

In [93]:
yeniFrame.loc["melisa"]["yaş"]

-1.4543440086624166

In [94]:
yeniFrame.loc["melisa","yaş"]

-1.4543440086624166

In [95]:
yeniFrame

             maaş       yaş  çalışma saati
melisa   0.440049 -1.454344      -2.074485
hüseyin  0.867057  1.895293       1.228605
çiğdem  -1.573579 -0.904120       0.191201
cemre    1.046747  1.035410      -0.930419

In [96]:
booleanFrame = yeniFrame < 0

In [97]:
yeniFrame

             maaş       yaş  çalışma saati
melisa   0.440049 -1.454344      -2.074485
hüseyin  0.867057  1.895293       1.228605
çiğdem  -1.573579 -0.904120       0.191201
cemre    1.046747  1.035410      -0.930419

In [98]:
yeniFrame[booleanFrame]

             maaş       yaş  çalışma saati
melisa        NaN -1.454344      -2.074485
hüseyin       NaN       NaN            NaN
çiğdem  -1.573579 -0.904120            NaN
cemre         NaN       NaN      -0.930419

In [99]:
yeniFrame[yeniFrame < 0]

             maaş       yaş  çalışma saati
melisa        NaN -1.454344      -2.074485
hüseyin       NaN       NaN            NaN
çiğdem  -1.573579 -0.904120            NaN
cemre         NaN       NaN      -0.930419

In [100]:
yeniFrame[yeniFrame["yaş"] > 0]

             maaş       yaş  çalışma saati
hüseyin  0.867057  1.895293       1.228605
cemre    1.046747  1.035410      -0.930419

In [102]:
yeniFrame

             maaş       yaş  çalışma saati
melisa   0.440049 -1.454344      -2.074485
hüseyin  0.867057  1.895293       1.228605
çiğdem  -1.573579 -0.904120       0.191201
cemre    1.046747  1.035410      -0.930419

In [104]:
yeniFrame.reset_index() #inplace kullanmadığımız için kendisinde değişiklik olmadı

     index      maaş       yaş  çalışma saati
0   melisa  0.440049 -1.454344      -2.074485
1  hüseyin  0.867057  1.895293       1.228605
2   çiğdem -1.573579 -0.904120       0.191201
3    cemre  1.046747  1.035410      -0.930419

In [107]:
yeniFrame

             maaş       yaş  çalışma saati
melisa   0.440049 -1.454344      -2.074485
hüseyin  0.867057  1.895293       1.228605
çiğdem  -1.573579 -0.904120       0.191201
cemre    1.046747  1.035410      -0.930419

In [108]:
yeniIndexListesi = ["mel", "hüs", "çiğ", "cem"]

In [110]:
yeniFrame["Yeni Index"] = yeniIndexListesi

In [113]:
yeniFrame

             maaş       yaş  çalışma saati Yeni Index
melisa   0.440049 -1.454344      -2.074485        mel
hüseyin  0.867057  1.895293       1.228605        hüs
çiğdem  -1.573579 -0.904120       0.191201        çiğ
cemre    1.046747  1.035410      -0.930419        cem

In [115]:
yeniFrame.set_index("Yeni Index")

                maaş       yaş  çalışma saati
Yeni Index
mel         0.440049 -1.454344      -2.074485
hüs         0.867057  1.895293       1.228605
çiğ        -1.573579 -0.904120       0.191201
cem         1.046747  1.035410      -0.930419

In [120]:
yeniFrame

             maaş       yaş  çalışma saati Yeni Index
melisa   0.440049 -1.454344      -2.074485        mel
hüseyin  0.867057  1.895293       1.228605        hüs
çiğdem  -1.573579 -0.904120       0.191201        çiğ
cemre    1.046747  1.035410      -0.930419        cem

In [123]:
yeniFrame.set_index("Yeni Index", inplace= True)

In [124]:
yeniFrame

                maaş       yaş  çalışma saati
Yeni Index
mel         0.440049 -1.454344      -2.074485
hüs         0.867057  1.895293       1.228605
çiğ        -1.573579 -0.904120       0.191201
cem         1.046747  1.035410      -0.930419

In [126]:
yeniFrame.loc["mel"]

maaş             0.440049
yaş             -1.454344
çalışma saati   -2.074485
Name: mel, dtype: float64

In [128]:
ilkIndeksler = ["Simpson", "Simpson","Simpson","South Park", "South Park", "South Park"]

In [129]:
icIndeksler = ["Homer","Bart","Merge","Cartman","Kenny","Kyle"]

In [131]:
birlesmisIndeks = list(zip(ilkIndeksler,icIndeksler))

In [133]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Merge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [135]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [136]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Merge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [137]:
type(birlesmisIndeks)

pandas.core.indexes.multi.MultiIndex

In [139]:
benimCizgiFilmListem = [[40, "A"],[10, "B"], [30, "C"], [9, "D"], [10, "E"], [11, "F"]]

In [140]:
cizgiFilmNumpy = np.array(benimCizgiFilmListem)

In [141]:
cizgiFilmDataFrame = pd.DataFrame(cizgiFilmNumpy, index = birlesmisIndeks, columns = ["yaş", "meslek"])

In [143]:
cizgiFilmDataFrame

                   yaş meslek
Simpson    Homer    40      A
           Bart     10      B
           Merge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [144]:
cizgiFilmDataFrame.loc["Simpson"]

      yaş meslek
Homer  40      A
Bart   10      B
Merge  30      C

In [145]:
cizgiFilmDataFrame.loc["South Park"].loc["Kenny"]

yaş       10
meslek     E
Name: Kenny, dtype: object

In [150]:
cizgiFilmDataFrame

                   yaş meslek
Simpson    Homer    40      A
           Bart     10      B
           Merge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [157]:
cizgiFilmDataFrame.index.names = ["Film adı", "İsim"]

In [167]:
cizgiFilmDataFrame

                   yaş meslek
Film adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Merge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [169]:
sozlukVerisi = {"Istanbul" : [30,20,np.nan], "Ankara" : [20,np.nan,25], "Izmır" : [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [171]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmır
0      30.0    20.0     40
1      20.0     NaN     39
2       NaN    25.0     38

In [173]:
havaDurumuDataFrame.dropna()

   Istanbul  Ankara  Izmır
0      30.0    20.0     40

In [175]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmır
0      30.0    20.0     40
1      20.0     NaN     39
2       NaN    25.0     38

In [177]:
havaDurumuDataFrame.dropna(axis = 1)

   Izmır
0     40
1     39
2     38

In [179]:
yeniVeri = {"Istanbul" : [30,20,np.nan], "Ankara" : [20,np.nan,25], "Izmır" : [40,39,38], "Antalya" : [45,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [181]:
yeniDataFrame

   Istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      20.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [193]:
yeniDataFrame.dropna(axis = 1, thresh = 2)

   Istanbul  Ankara  Izmır
0      30.0    20.0     40
1      20.0     NaN     39
2       NaN    25.0     38

In [195]:
yeniDataFrame

   Istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      20.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [197]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmır  Antalya
0      30.0    20.0     40     45.0
1      20.0    20.0     39     20.0
2      20.0    25.0     38     20.0

In [243]:
maasSozlugu = {"Departman" : ["Yazilim", "Yazilim", "Pazarlama", "Pazarlama", "Hukuk", "Hukuk"], 
              "Calisan Ismi" : ["Ahmet", "Mehmet", "Atıl", "Burak", "Zeynep", "Fatma"],
              "Maas" : [100,150,200,300,400,500]}

In [245]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [247]:
maasDataFrame

   Departman Calisan Ismi  Maas
0    Yazilim        Ahmet   100
1    Yazilim       Mehmet   150
2  Pazarlama         Atıl   200
3  Pazarlama        Burak   300
4      Hukuk       Zeynep   400
5      Hukuk        Fatma   500

In [249]:
grupObjesi = maasDataFrame.groupby("Departman")

In [251]:
grupObjesi.count()

           Calisan Ismi  Maas
Departman
Hukuk                 2     2
Pazarlama             2     2
Yazilim               2     2

In [255]:
a = maasDataFrame.groupby("Maas")

In [261]:
grupObjesi.mean(numeric_only= True)

            Maas
Departman
Hukuk      450.0
Pazarlama  250.0
Yazilim    125.0

In [263]:
grupObjesi.max()

          Calisan Ismi  Maas
Departman
Hukuk           Zeynep   500
Pazarlama        Burak   300
Yazilim         Mehmet   150

In [265]:
grupObjesi.min()

          Calisan Ismi  Maas
Departman
Hukuk            Fatma   400
Pazarlama         Atıl   200
Yazilim          Ahmet   100

In [267]:
grupObjesi.describe()

           Maas
          count   mean        std    min    25%    50%    75%    max
Departman
Hukuk       2.0  450.0  70.710678  400.0  425.0  450.0  475.0  500.0
Pazarlama   2.0  250.0  70.710678  200.0  225.0  250.0  275.0  300.0
Yazilim     2.0  125.0  35.355339  100.0  112.5  125.0  137.5  150.0

In [269]:
sozluk1 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Atıl"], "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"] ,
          "Kalori" : [100,200,300,400]}

In [273]:
dataFrame1 = pd.DataFrame(sozluk1, index = [0,1,2,3,])

In [275]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [277]:
sozluk2 = {"Isim" : ["Osman", "Levent", "Atlas", "Fatma"], "Spor" : ["Koşu", "Yüzme", "Koşu", "Basketbol"] ,
          "Kalori" : [200,200,50,400]}

In [279]:
dataFrame2 = pd.DataFrame(sozluk2, index = [4,5,6,7,])

In [285]:
sozluk3 = {"Isim" : ["Ayşe", "Mahmut", "Duygu", "Nut"], "Spor" : ["Koşu", "Yüzme", "Badminton", "Tenis"] ,
          "Kalori" : [300,400,500,250]}

In [287]:
dataFrame3 = pd.DataFrame(sozluk3, index = [8,9,10,11,])

In [295]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [297]:
dataFrame2

     Isim       Spor  Kalori
4   Osman       Koşu     200
5  Levent      Yüzme     200
6   Atlas       Koşu      50
7   Fatma  Basketbol     400

In [299]:
dataFrame3

      Isim       Spor  Kalori
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nut      Tenis     250

In [303]:
pd.concat([dataFrame1,dataFrame2,dataFrame3], axis = 0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     200
6    Atlas       Koşu      50
7    Fatma  Basketbol     400
8     Ayşe       Koşu     300
9   Mahmut      Yüzme     400
10   Duygu  Badminton     500
11     Nut      Tenis     250

In [317]:
mergeSozluk1 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Atıl",],
                "Spor " : ["Koşu", "Yüzme", "Koşu", "Basketbol"]}

In [319]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [321]:
mergeDataFrame1

     Isim      Spor
0   Ahmet       Koşu
1  Mehmet      Yüzme
2  Zeynep       Koşu
3    Atıl  Basketbol

In [323]:
mergeSozluk2 = {"Isim" : ["Ahmet", "Mehmet", "Zeynep", "Atıl",],
                "Kalori " : [100,200, 150, 250]}

In [325]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [327]:
mergeDataFrame2

     Isim  Kalori
0   Ahmet      100
1  Mehmet      200
2  Zeynep      150
3    Atıl      250

In [329]:
pd.merge(mergeDataFrame1,mergeDataFrame2, on="Isim") #ortak parametreyi giriyoruz

     Isim      Spor   Kalori
0   Ahmet       Koşu      100
1  Mehmet      Yüzme      200
2  Zeynep       Koşu      150
3    Atıl  Basketbol      250

In [331]:
maasSozluk = {"Isim": ["Atıl", "Zeynep", "Mehmet", "Ahmet"], 
             "Departman" : ["Yazılım", "Satış", "Pazarlama", "Yazılım"], 
             "Maas" : [200,300,400,500]}

In [333]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [335]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   200
1  Zeynep      Satış   300
2  Mehmet  Pazarlama   400
3   Ahmet    Yazılım   500

In [337]:
maasDataFrame["Departman"]

0      Yazılım
1        Satış
2    Pazarlama
3      Yazılım
Name: Departman, dtype: object

In [339]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Satış', 'Pazarlama'], dtype=object)

In [341]:
maasDataFrame["Departman"].nunique()

3

In [343]:
maasDataFrame["Departman"].value_counts()

Departman
Yazılım      2
Satış        1
Pazarlama    1
Name: count, dtype: int64

In [355]:
def bruttenNete(maas):
    return maas * 0.66

In [359]:
maasDataFrame["Maas"].apply(bruttenNete)

0    132.0
1    198.0
2    264.0
3    330.0
Name: Maas, dtype: float64

In [361]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [371]:
yeniVeri = {"Karakter Sınıfı" : ["South Park", "South Park", "Simpson", "Simpson","Simpson"],
           "Karakter Ismi" : ["Cartman", "Kenny", "Hommer", "Bart", "Bart"],
           "Karakter Yas" : [9,19,50,20,10]}

In [373]:
karakterDF = pd.DataFrame(yeniVeri)

In [375]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0      South Park       Cartman             9
1      South Park         Kenny            19
2         Simpson        Hommer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [385]:
karakterDF.pivot_table(values = "Karakter Yas", index = ["Karakter Sınıfı", "Karakter Ismi"], aggfunc="sum") #Bart'ın yaşını toplar

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Hommer                   50
South Park      Cartman                   9
                Kenny                    19

In [ ]:
dataFrame = pd.read_excel("maas.xlsx") #Excel'den tabloyu çekmeye yarar
doluDegerlerDataFrame.to_excel("yenimaas.xlsx") #yaptığın değişiklikli tabloyu excel olarak kaydeder